app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 17 Jul 2013 04:51:43 UTC +00:00], ["name", "Joe Blow"], ["provider", "twitter"], ["uid", "12345"], ["updated_at", Wed, 17 Jul 2013 04:51:43 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."provider" = 'twitter' AND "users"."uid" = '14281032' LIMIT 1
---
  def create
    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)