app/controllers/texts_controller.rb

SELECT "texts".* FROM "texts"
---
  def index
    @texts = Text.all.to_a

INSERT INTO "texts" ("content", "created_at", "language", "tags", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @text = current_user.texts.build(text_params)
    if @text.save

SELECT "texts".* FROM "texts" WHERE "texts"."id" = 1 LIMIT 1
---
  def show
    @text = Text.find_by_id(params[:id])

SELECT "texts".* FROM "texts" WHERE "texts"."id" = 4 LIMIT 1
---
  def edit
    @text = Text.find_by_id(params[:id])